config/DataProcessors/PlanBible2017Bot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>PlanBible2017Bot</Name>
			<Comment>за год</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

config/InformationRegisters/СессииКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СессииКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/ТипыОтветовТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыОтветовТелеграм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кнопка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контакт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Локация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Enums/ВидыРегулярныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыРегулярныхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПланЧтения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объявления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Репост</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Catalogs/РегулярныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>РегулярныеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегулярныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФорматирования</Name>
					<Comment>Параметр "parse_mode" команды sendmessage</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидФорматирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьПредварительныйПросмотрСсылок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТихаяОтправка</Name>
					<Comment>disable_notification</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированныйТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/DataProcessors/PlanBible2017Bot/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// <Телеграм-Бот План чтения Библии на год (старт 2017).>
// 
////////////////////////////////////////////////////////////////////////////////

Перем Телеграм Экспорт;

////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД БОТА
//

Функция ПолучитьСправку(Сообщение)
	
	ТекстСообщения = ПолучитьМакет("Справка").ПолучитьТекст();
	
	Результат = Телеграм.sendMessage(Сообщение.Чат, ТекстСообщения);
	
	Возврат Результат;
	
КонецФункции

Функция ОставитьОтзыв(Сообщение) Экспорт
	
	ТекстСообщения = "Оставьте отзыв о боте следующим сообщением и он будет направлен разработчику.";
	
	Результат = Телеграм.sendMessage(Сообщение.Чат, ТекстСообщения);
	
	Если Результат.Результат Тогда
		ОтправленноеСообщение = Результат.result;	// Возвращаем ссылку на отправленное сообщение
	Иначе
		//ТекстОписания = СтрШаблон("%1
		//|Чат: %2
		//|Текст: %3", Результат.description, Сообщение.Чат, ТекстСообщения);
		ТекстОписания = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("[description]
		|Чат: [Чат]
		|Текст: [ТекстСообщения]", Новый Структура("description, Чат, ТекстСообщения",Результат["description"], Сообщение.Чат, ТекстСообщения));
		ЗаписьЖурналаРегистрации("ИнфоБот", УровеньЖурналаРегистрации.Ошибка,,, ТекстОписания);
	КонецЕсли;
	
	ЗаписьСессии = РегистрыСведений.СессииКонтрагентов.СоздатьМенеджерЗаписи();
	ЗаписьСессии.Бот = Телеграм.Бот;
	ЗаписьСессии.Идентификатор = Сообщение.Контрагент;
	ЗаписьСессии.ДатаСоздания = ТекущаяДата();
	ЗаписьСессии.ДанныеСессии = ЗначениеВСтрокуВнутр(Новый Структура("Действие, Сообщение", "Отзыв", ОтправленноеСообщение.message_id));
	ЗаписьСессии.Записать();
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ УПРАВЛЕНИЯ СООБЩЕНИЯМИ TELEGRAM
//


Процедура ПостПланЧтения() Экспорт
	
	ТекстПлана = ПолучитьТекстПлана(ТекущаяДата());
	
	Если ЗначениеЗаполнено(ТекстПлана) Тогда
		ТекстСообщения = Формат(ТекущаяДата(), "ДЛФ=Д") + " читаємо: " + ТекстПлана;
	Иначе 
		ТекстСообщения = "На " + Формат(ТекущаяДата(), "ДЛФ=Д") + " план читання не сформовано";
	КонецЕсли;
	
	Результат = Телеграм.sendMessage("-1001227968714", ТекстСообщения);
	
КонецПроцедуры

Процедура ПрочитатьИОбработатьСообщение(Сообщение) Экспорт

	Если Сообщение.ТипОтвета = Перечисления.ТипыОтветовТелеграм.Кнопка Тогда	// Это пришёл запрос доступа

		ДанныеСообщения = Боты.ПолучитьДанныеСообщения(Телеграм.Бот, Сообщение.update_id);
		// ...

		// Найдём админов бота
		Запрос = Новый Запрос;
		Запрос.Текст =
		"//здесь был текст запроса";
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;

		// Каждому админу отправим запрос на рассмотрение
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИдентификаторАкцепта = Боты.СоздатьСессию(Телеграм.Бот, Новый Структура("Действие, Контрагент", "Акцепт", Сообщение.Контрагент));
			ИдентификаторЗапрета = Боты.СоздатьСессию(Телеграм.Бот, Новый Структура("Действие, Контрагент", "Запрет", Сообщение.Контрагент));

			reply_markup = СтрШаблон("{""inline_keyboard"":[[{""text"":""Разрешить"",""callback_data"":""%1""},{""text"":""Отклонить"",""callback_data"":""%2""}]]}", ИдентификаторАкцепта, ИдентификаторЗапрета);
			parse_mode = "Markdown";
			Телеграм.sendMessage(Выборка.Контрагент.Идентификатор, СтрШаблон("Поступил запрос на предоставление доступа от [%1](http://t.me/%2).", Сообщение.Контрагент.ТелеграмИмя, Сообщение.Контрагент.ТелеграмНик), parse_mode,,,, reply_markup);
		КонецЦикла;

		//ИзменитьКлавиатуруСообщения(Сообщение.Чат, ДанныеСообщения.callback_query.message.message_id);	// Удалим кнопку запроса.

	ИначеЕсли Сообщение.ТипОтвета = Перечисления.ТипыОтветовТелеграм.Текст Тогда	
		
		ДанныеСообщения = Боты.ПолучитьДанныеСообщения(Телеграм.Бот, Сообщение.update_id);
		
		Если СокрЛП(ДанныеСообщения.message.text) = "/start"  Тогда
			
			ТекстПлана = ПолучитьТекстПлана(ТекущаяДата());
			
			Если ЗначениеЗаполнено(ТекстПлана) Тогда
				ТекстСообщения = "План читання на сьогодні: " + ТекстПлана;
			Иначе 
				ТекстСообщения = "На " + ТекущаяДата() + " план читання не сформовано";
			КонецЕсли;
			
		Иначе 
			
			ТекстСообщения = "Не відома команда";
			
		КонецЕсли;
		
		Результат = Телеграм.sendMessage(Сообщение.Чат, ТекстСообщения);
		
	КонецЕсли;
	
	Если Результат["ok"] Тогда
		Боты.ЗакрытьСообщение(Телеграм.Бот, Сообщение.update_id);	
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Функция ПолучитьТекстПлана
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ПолучитьТекстПлана(НаДату) Экспорт 
	
Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегулярныеСообщения.Текст КАК Текст
		|ИЗ
		|	Справочник.РегулярныеСообщения КАК РегулярныеСообщения
		|ГДЕ
		|	РегулярныеСообщения.Дата = &НаДату
		|	И РегулярныеСообщения.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыРегулярныхСообщений.ПланЧтения)";
	
	Запрос.УстановитьПараметр("НаДату", НачалоДня(НаДату)); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Текст;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //ПолучитьТекстПлана
